/*
 *     1. 클래스의 구성요소
 *        ----- 설계 : 데이터 / 기능 / 저장 
 *                                 ---- 객체 : 실제 동작 
 *                                     | 어떤 데이터 이용 => 변수 
 *                                     | 어떤 움직일지 => 메소드
 *        class ClassName{
 *          -----------------
 *            변수 
 *             => 공통으로 사용하는 변수 
 *                | => static (정적변수) => 공유변수 
 *             => 객체마다 사용하는 변수 (따라 저장) 
 *                | => instance변수 
 *          -----------------
 *            생성자 : 변수의 초기화 / 메모리 저장 호출 
 *                   프로그램 시작과 동시에 처리하는 기능 
 *                   => 객체 생성시 한번 호출 
 *                   => 호출시에 반드시 new를 동반 
 *                      new 생성자()
 *                   => 자동로그인 / 서버 연결 / 데이터베이스 연결 
 *                   => 반드시 존재 
 *                      만약에 없는 경우 => 자동으로 생성 
 *                                      ----------
 *                                      디폴트 생성자 => 매개변수가 없는 생성자
 *          -----------------
 *            메소드 
 *              = static 메소드 : 공유하는 기능 
 *              = 인스턴스 메소드 : 객체마다 따라 기능 수행
 *              = 다른 클래스와 연결을 할때 사용 
 *              = 사용은 변수를 활용  
 *          -----------------
 *        }
 *     2. 클래스에서 객체 생성 방법 
 *        1) 생명 주기 
 *           -------
 *           객체 생성 ====== 객체 활용 ====== 객체 소멸 ====== 메모리 해제
 *           class A       a.display()     a=null        System.gc()       
 *           {
 *              void display(){}
 *           }
 *           
 *             |=> 메모리 주소를 저장 => 클래스의 변수 / 객체
 *               
 *           A a=new A();
 *               --- --- 생성자 : 변수의 초기값을 설정 
 *               | 새로운 메모리 생성 => 메모리 주소를 저장 
 *           | = 사용자 정의 데이터형 
 *           
 *           메모리 할당 
 *           
 *           --------------------------------------------
 *             MethodArea : 클래스 정보 (메소드) , static 변수
 *           --------------------------------------------
 *             Stack : 메모리 자체 관리 = 지역변수 , 매개변수 
 *                     {}이 끝나면 자동 메모리 회수 
 *                     => 객체 
 *           --------------------------------------------
 *             Heap : 실제 데이터가 저장 = new사용시 생성 
 *                    => 배열 데이터 / 객체 데이터 
 *                    => 관리 = 개발자 = GC
 *           --------------------------------------------
 *           
 *           class A
 *           {
 *              int a=20; // 0 => heap
 *              void display()
 *              {
 *                 int b=10; => stack : 지역변수 우선 순위
 *                 System.out.println(a+b) 
 *              }
 *           }
 *           
 *           class A
 *           {
 *              int a;
 *              static int b
 *              void display(){}
 *           }
 *           
 *           1) 저장 
 *              A aa=new A();
 *               stack              heap
 *              ---aa----        0x100------a-------
 *                0x100                     0  ==> aa.a
 *              ---------             --------------        
 *                                      display() ==> aa.display()
 *                                    --------------
 *             A bb=new A();
 *                stack              heap
 *              ---bb----        0x200------a-------
 *                0x200                     0  ==> bb.a
 *              ---------             --------------        
 *                                      display() ==> bb.display()
 *                                    --------------
 *  --------
 *    -b-
 *     0  => aa.b / bb.b / A.b
 *    ---
 *  
 *  --------
 *             
 *             
 *     3. 생성자의 역할 
 *        => 객체 생성시 호출하는 메소드 (한번만 사용)
 *           --------- 생성자를 이용해서 생성 
 *        => 인스턴스변수 / static 변수의 초기화 
 *           *** 클래스 영역은 선언만 가능하다 
 *           class A
 *           {
 *              for() a.name => 오류
 *              => 선언과 동시에 값설정 int a=100
 *              => int a;
 *                 a=100; (X) 
 *           }
 *           
 *           => 변수의 초기화 
 *              1) 명시적 초기화 
 *                 int a=100;
 *              2) 초기화 블록 
 *                 인스턴스 초기화 블록 
 *                 {
 *                 }
 *                 static 초기화 블록 
 *                 static
 *                 {
 *                 }
 *              3) 생성자 
 *              
 *              class A
 *              {
 *                 int a=100;
 *                 B b=new B();
 *                 static int b=200;
 *                 {
 *                    
 *                    a=200;
 *                    b=300;
 *                 }
 *                 
 *                 A()
 *                 {
 *                    a=300;
 *                    b=400;
 *                    B b=new B()
 *                 }
 *                 static
 *                 {
 *                    a=500;(X) => instance사용이 안된다 
 *                    b=1000;
 *                 }
 *              }
 *              static메소드 / static블록에는 인스턴스 사용이 불가능하다
 *              
 *              => 인스턴스 : 객체 변수 / static : 클래스 변수 
 *          => 특징 
 *             1) 클래스명과 동일 (대소문자 구분)
 *             2) 리턴형이 없다 (void불가)
 *                class A  A() / class B  B()     
 *                void A()  int B() ==> 생성자가 아니고 일반 메소드
 *                => 특별한 메소드 
 *             3) 생성자는 여러개 만들수 있다
 *                => 매개변수의 갯수 / 데이터형이 다르다 
 *                   A() / A(int a) / A(double d) ...
 *                   A(int a ,int b) ...
 *                => 오버로딩 지원 
 *             
 *        => 
 *     4. 변수 종류 
 *        = 지역변수 : 메소드영역에서 선언 / 메소드종료시 소멸 => 스택공간 
 *        = 정적변수 : 공유변수 / 프로그램 종료시에 소멸 => MethodArea
 *                   컴파일시 생성 => 자동으로 생성 
 *        = 인스턴스 변수 : 객체마다 따로 가지고 있는 메모리 
 *                      프로그램 종료시까지 => 힙
 *                      new를 이용해서 생성 
 *                      
 *        변수 (정적/인스턴스 변수) 
 *        메소드(정적 / 인스턴스 메소드) 
 *        생성자 : 필요가 없는 경우 => 자동 생성 
 *                필요가 있는 경우 => 직접 생성 
 *                
 *        변수 / 메소드 => 선언하는 것은 동일 
 *        ---
 *         | 1) 기본형 
 *           2) 클래스 => 사용자 정의 / 라이브러리 
 *           3) 배열 
 *           4) 상수 / 열거형 
 *        
 *     -----------------------
 *     4-1. 접근지정어 
 *          public / protected / default / private 
 *     4-2. 제어어 
 *          static / final / abstract 
 *     
 *     5. 객체지향의 3대특성
 *        = 캡슐화 : 데이터 보호
 *          => Getter / Setter 
 *             읽기       쓰기  ===> 변수의 기능 
 *          => lombok 
 *        = 상속 : 확장 / 재사용 
 *          => extends 
 *             상속 내리는 클래스 ==> 재사용 
 *             상속 받는 클래스 ==> 확장
 *          => 포함 클래스
 *        = 다형성 : 새로운 기능 추가 / 기존의 기능 변경 
 *          => 오버로딩 
 *          => 오버라이딩 
 *     6. 다른 클래스와 연동 (클래스 종류) 
 *        추상 클래스 / 인터페이스 / 내부 클래스 
 *     --------------------------------------------
 *     사전에 에러 방지 / 비정상 종료 방지  : 예외처리
 *       => 컴파일 에러 : 반드시 예외처리  
 *       => 실행시 에러 
 *     --------------------------------------------
 *     10장 => java.lang 
 *     11장 => java.util 
 *     ------------------ 컬렉션 / IO / 데이터베이스 
 *                        ----------------------
 *       쓰레드 / 네트워크 : 기본 
 *        
 *     class A
 *     {
 *        Scanner scan=new Scanner(System.in);
 *        int a=10,b;
 *        void aaa()
 *        {
 *           a=100
 *        }
 *        int bbb()
 *        {
 *           b=200;
 *           
 *        }
 *        void ccc()
 *        {
 *            
 *        }
 *     }
 */
class A
{
	static int a=10;
	int b=100;
	static void display()
	{
		int a=20;
		
		System.out.println(a+A.a);
	}
	void aaa()
	{
		a=100;
		this.b=200;
	}
}
public class 클래스의구성요소 {
    public static void main(String[] args) {
		A.display();
		A.a=100;
		A aa=new A(); // 100
		// this=aa
		A bb=new A(); // 1000
		// this=bb
		bb.a=1000;
		
	}
}