/*
 * 
 * 1장 
 * 실행 방법 ( 컴파일 인터프리터)
 * 
 * 자바 특징
 *  이식성이 좋다 (모든 운영체제에서 실행)  
 *  자동 메모리 해제 (가비지 컬렉션) -> 필요시엔 직접 호출 (system.gc)
 *  객체 지향 프로그램 : 조립식 (메인보드)
 *                     spring -> cbd
 *                     이력서 -> 산출물
 * 설치 ( 자바 jdk , 편집기)
 *      jdk.java.net -> jdk21 -> 자바 개발 툴
 *      eclipswe.org -> j2ee (java, web) -> 편집기
 *      -> path : c://jdk-21\bin
 *      -> classpath : .;c;\\jdk-21\lib
 * 주의점 / 주석 
 *  -> 모든 프로그램은 main을 필요로 한다
 *  -> 프로그램은 컴퓨터에 명령을 수행하게 만든다
 *                           저장 -> 출력
 *                           명령이 끝나면 반드시 ;
 *  -> 클래스명과 파일명이 동일해야 된다
 *  -> 가급적이면 한글명을 사용하지 않는다
 *  -> 주석
 *     여러줄 주석 
 *     한줄 주석
 *     4,5page 자바특징 실행과정
 *     29 주석
 *     30 세미콜론
 *     
 *     원시소스
 *     a.java --------- a.class ------ 실행
 *             javac              java
 *             기계어로 변경           한줄씩 읽어서 출력
 *             컴파일               인터프리터
 *    1) 재사용
 *    2) 가독성
 *    3) 확장성
 *    => 유지보수성
 *    
 *    
 *    소스암기 x -> 프로그램의 순서
 */
public class 자바동작과정 {
	public static void main(String[] args) {
		// 화면에 출력 명령
		System.out.println("Hello Java");
		
	}

}
