/*/
 * 36page
 * 
 * 변수 -> 한개의 데이터를 저장하는 메모리 공간
 *          ----
 *          -> 모든 프로그램 언어는 메모리 -> Ram에 저장
 *                                     ---- 프로그램 종류시 해제
 *      ㅣ
 *      파일
 *      
 *      ㅣ
 *      오라클 : 영구적인 저장 장치 / MySQL / PostgraSQL 
 *      ----------
 *      
 *      저장되는 과정
 *    메모리 크기 -> 데이터형 (자료형)
 *    기본형 / 참조형 (사용자 정의)
 *           -> 배열 / 클래스 
 *      ㅣ 자바에서 제공하는 데이터형
 *         ---------------
 *         정수
 *            byte  (1byte -> 8bit) 0,1 -> 8개까지 저장이 가능 127
 *            short (2byte -> 16bit) 32767
 *            int 4byte -> 32bit 2147483647
 *            -> 일반 프로그램에서 가장 많이 사용
 *            -> 컴퓨터는 무조건 숫자는 int인식
 *            long 8byte -> 64bit 
 *         실수
 *           float 4byte, 소수점 : 6자리
 *                   vectorDB
 *           double 8byte 소수점 : 15자리
 *               Default -> 컴퓨터가 인식 -> 건축 설계
 *         논리
 *          boolean true/false 1byte
 *        
 *         문자
 *          char 문자 1개
 *               값 => 'A' , '홍'
 *               여러개 => "ABC"
 *               
 *      변수 설정
 *      데이터형 변수명 = 값 (초기값) 변수 (변하는 수) / 상수 
 *      int a=10;
 *      final int b = 10; 상수
 *      변수 명칭법
 *      1. 알파벳, 한글로 시작
 *         ㅣ
 *         대소문자 구분
 *      2. 숫자 사용이 가능
 *         앞에 사용할 수 없다.
 *         a1 a2 a3
 *      3. 특수 문자 사용이 가능
 *         _ $ 
 *         1) 임시 변수
 *         2) 단어가 2개 이상인 경우 file_name
 *      4. 공백은 사용할 수 없다
 *      5. 키워드는 사용이 불가능  int int
 *      ----
 *      약속사항
 *       변수는 소문자로 시작
 *       상수는 대문자      
 *       final double PI=3.14
 *      캐멀방식
 *       단어 두개 이상 
 *       firstName
 *       first_name   
 */
public class 변수 {
	public static void main(String[] args) {
		
	}

}
