/*
 *     객체 지향 프로그램의 구조 
 *     
 *     class ClassName
 *     {
 *        --------------
 *          변수 ==>
 *        --------------
 *          생성자 ============> 메모리에 저장 
 *        --------------
 *          메소드 ==> 
 *        --------------
 *     }
 *     
 *     메소드 
 *       = 클래스 영역에 설정 
 *       = 메소드안에 메소드는 들어 갈 수 없다 => 따라 
 *       = 한가지 기능을 수행할 수 있게 명령문을 사용한다 
 *         -------- 재사용의 목적 
 *       = 유지보수 편리성 
 *       = 구조적인 프로그램 => 문단을 나눠서 서술 
 *       = 가독성이 좋다 
 *       = 에러 처리가 편리 
 *       = 반복을 제거할 수 있다 
 *       = 메소드 제작 = 호출 
 *                    ---- 무조건 처음 부터 다시 시작  
 *     ----------------------------------------------
 *     1. 메소드 제작 
 *        = 메소드 선언부 
 *           => 리턴형 / 메소드명 / 매개변수 (인자)
 *        = 메소드 구현부 
 *           => 값을 보내주는 방법 
 *              => return 값
 *     2. 호출 순서 / 호출 방법 
 *     3. 다른 클래스에 메소드 사용법 
 *     4. 어디까지가 한개의 기능인지 확인 
 *        ----------------- 재사용이 가능 
 *     5. main에서는 변수/연산자/제어문 => 사용하지 않는다 
 *        무조건 => 메소드 호출
 *        
 *     ------------------------------------
 *      메소드 
 *        = 인스턴스 : new를 이용해서 메소드 저장후  
 *           String s="Hello" 
 *           "Java"
 *           객체명.메소드()
 *        = 정적 : 컴파일시에 자동으로 저장 
 *          static 
 *          클래스명.메소드()
 *   
 *     메소드 제작 
 *       = 사용자로부터 요청값을 받아서 요청처리 = 결과값을 전송 
 *     -----------------------------------
 *             리턴형          매개변수 
 *             = 1개만 설정     = 사용자가 요청값 => 여러개 사용이 가능 
 *     -----------------------------------
 *              O               O
 *              String substring(int start)
 *              String substring(int start,int end)
 *     -----------------------------------
 *              O               X
 *              double random()
 *              ------       X
 *     -----------------------------------
 *              X               O
 *              void println(String s) // 자체 출력 
 *     -----------------------------------
 *              X               X
 *              void println() => 다음줄 출력 
 *     -----------------------------------
 *     리턴형 : 사용자 요청 처리 => 결과값을 보내준다 
 *                            --------------
 *                            한개만 보내준다 
 *                            => 기본형 
 *                               String / int / long/ double / boolean
 *                            => 여러개면 : 배열 / 컬렉션 / 사용자 정의 클래스
 *     매개변수 : 사용자가 보내준 값 
 *              => 여러개가 보내줄수 있다 
 *              => 가변 ...
 *     메소드명 : 변수 식별자와 동일 (소문자로 시작) 
 *     ----------------------------------------------------------
 *     형식)
 *          선언부 
 *          리턴형 메소드명(매개변수 ...)
 *          -----
 *          구현부 
 *          {
 *               .... 요청처리 
 *               return 값;
 *                      --- 리턴형의 데이터형과 동일 
 *          }
 *          
 *          호출 
 *            메소드명(매개변수에 값을 설정) 
 *          
 *          예) 
 *               int add(int a,int b)
 *               {
 *                  return a+b;
 *               }
 *               
 *               int c=add(10,20)
 *                   -- a+b 
 *                   
 *               void는 메소드만 호출 
 */
// 사용자로부터 단을 받아서 => 해당 단의 구구단 출력 => 매개변수 존재 / 리턴형 X
import java.util.*;
public class 메소드_1 {
	static void gugu(int dan)
	{
		for(int i=1;i<=9;i++)
		{
			System.out.println(dan+"*"+i+"="+i*dan);
		}
		return; // void면 생략 가능 / 생략일 경우 컴파일시 자동으로 return
	}
	static void process()
	{
		Scanner scan=new Scanner(System.in);
		System.out.println("2~9까지 사이의 단 입력:");
		int dan=scan.nextInt();
		gugu(dan);
	}
	
	public static void main(String[] args) {
		
	}

}
