/*
 *   메소드 : 클래스의 종속 (클래스안에 사용) 
 *   ----- 특정 작업(한가지 작업) 수행하는 코드의 집합 
 *                                  ---- 명령문 
 *    |= 반복되는 코드를 제거 : 코드가 간결하다 / 재사용이 가능 
 *                                       -----------
 *    장점 
 *     = 코드의 중복 줄일 수 있다 
 *     = 가독성이 뛰어나다 
 *     = 유지보수가 쉬워진다
 *       ------ 
 *     = 다른 클래스에서 사용이 가능 (재사용)
 *                             ------
 *   ====> 기본 역할 : 클래스와 클래스를 연결하는 역할 
 *                   ----   ----
 *                    => 동작 / 행위 
 *   메소드 구조 
 *   
 *   static int display()
 *   {
 *       int a=10;
 *       //System.out.println(a);
 *       a++;
 *       return a;
 *   }
 *        
 *   display(); a=11
 *   display(); a=? 11
 *   display(); a=? 11
 *   
 *   리턴형 메소드명(매개변수) 선언부
 *   ----- => 값보다 크거나 같다 long => 권장 : 같다 
 *   {
 *      구현부
 *      return; = void = 생략리 가능 
 *      retur 값 10
 *            --
 *   }
 *   리턴형 => 결과값 
 *   매개변수 => 요청값 
 *   사용자 요청값을 받아서 어떤 결과값을 보낼 것인가?
 *                        ----- 반드시 1개만 존재 
 *                              배열/컬렉션 
 *   ---------- 매개변수 (갯수 상관 없다)
 *                     ------------- 3개 이상 => 배열 / 클래스 
 *   접근지정어 리턴형 메소드명(매개변수...) ==> 선언부 
 *   ------- -----       -----------
 *   {
 *       처리 => 구현부 
 *   }
 *     
 *   => 호출 메소드명(값...)
 *   
 */
public class 메소드_6 {

}
