/*
 *  반복문
 *    for : 화면 UI (Web), 알고리즘(배열, 이차 for)
 *          반복 횟수 알고 있는 경우
 *    while : 백엔드
 *            파일 제어 / 데이터베이스 / 네트워크
 *            반복 횟수를 알 수 없는 경우
 *            = 종료 시점 (break)
 *            = 건너뛰기 (continue)
 *    do while : 한번을 반드시 실행이 돼야 하는 경우
 *               사용빈도 극히 드물다.
 *    while
 *     = 형식)
 *             초기값    1 
 *             while(조건식)  => false 면 종료   2
 *             {           
 *                  반복 수행문장(true 라면 문장 수행)   3
 *                  증감식 (증가된 값을 2번으로 이동)   4
 *             }
 *             
 *             초기값 === 조건식 === 반복 수행문장 === 증가
 *                        |                        |
 *                         ------------------------
 *                        | 트루면 계속 수행
 *                        | 폴스면 종료
 *      변수 == 데이터형 익히기
 *      연산자 == 결과값
 *      제어문 == 형식 => 순서
 *      배열 == 어떤 데이터를 묶어서 사용
 *      메소드 == 어떤 역할 / 형식
 *      ------------------------ 객체 지향 프로그램
 *      + 라이브러리 : 응용
 */
// 1~10 까지 출력
public class 반복문_while_1 {
public static void main(String[] args) {
	//초기값
	int i=1;
	// 조건문
	while(i<=10)
	{
		System.out.println(i+" ");
		// 반복 실행문장
		i++;
		// 증가식
	}
	System.out.println("\n==for==");
	
	for(i=1;i<=10;i++)
	{
		System.out.println(i+" ");
	}
	
	
	
	
}
}
