/*
 *  1. 변수 : 한개의 데이터 저장하는 메모리 공간의 이름
 *           --------
 *           메모리 크기
 *           => 데이터형 (자료형)
 *           ----------
 *               |
 *            ----------
 *           |           |
 *       기본형 (자바지원)   참조형(사용자 정의) = 배열 / 클래스
 *          |
 *        정수 : int long..
 *        실수 : float double
 *        논리 : boolean
 *        문자 : char (0~65535) => 멀티바이트(2바이트) / 유니코드 (UTF-8)
 *        ----> 오버플로우 (저장 범위를 벗어나면 안된다)
 *   2. 사용자 요청에 맞게 가공
 *      1) 연산자
 *          단항연산자
 *            = 증감 연산자 ( ++ --)
 *              => 반복문에서 주로 사용
 *              => 게임 제작
 *            = 부정 연산자 (!) => true/false
 *              => WEB에서 사용 (예약일 아닌 경우 / 로그인 안한 경우)
 *            = 형변환 연산자 : 데이터형을 변경
 *              => 숫자만 가능
 *                byte < char < int < long <double 
 *              => 라이브러리에서 주로 사용
 *                Math.random()
 *          이항연산자
 *           = 산술 연산자 : + - *   / %
   *                      + 일반 산술 / 문자열 결합
   *                      / 0으로 나눌 수 없다 / 정수/정수=정수
   *                      % 부호는 앞에 숫자 부후가 결정
   *                      => 통계 / 모든 연산자는 산술로 변경 후 처리가 가능
 *           = 비교 연산자 : == != < > <= >=  무조건 true false
 *                         => 조건문에서 주로 사용
 *                         if/반복문에서 주로 사용
 *                         검색
 *           = 논리 연산자 : && || 
 *                        범위 설정
 *                         (조건) && (조건) => 범위 지정
 *                         효율적인 연산 : 앞 조건 false
 *                         
 *                         (조건) || (조건) => 범위를 벗어나는 경우
 *                         효율적인 연산 : 앞 조건 true
 *           = 대입 연산자  =  +=  -= :복합대입연산자
 *                        int a=10;
 *                        a+=1 == a=a+1
 *                        --------- 여러개 증가할 경우 사용
 *         삼항연산자 => HTML(JSP) => if~else 
 *                     형식) 조건 ? 값1 : 값2
 *      2) 제어문
 *            => 프로그램 : 순차적 
 *                       위에서 아래로 => 한줄씩 번역
 *                   프로그램의 종류
 *                     = 평문 : 일반 명령문만 수행
 *                           => 변수선언, 연산처리
 *                     = 조건문 : 필요시에만 명령문을 수행
 *                               => 상황에 따라 다른 기능을 수행
 *                               => 검색
 *                               => 상세보기
 *                               => 로그인 처리 / 아이디 중복 ...
 *                          1) 단일 조건문
 *                             => 독립적 조건문 : 한개씩 무조건 수행 => 속도가 늦다
 *                                             => 여러개를 동시에 수행이 가능
 *                                             => 중복적으로 수행
 *                                             => 필터링
 *                             => 형식)
 *                                {
 *                                   조건이 true일 때 수행문장 => false 인 경우는 건너뛴다
 *                                 }
 *                          2) 선택 조건문 
 *                             => true / false 일 때 나눠서 작업
 *                             => WEB에서 주로 사용 : 무조건 결과값을 전송
 *                             => 형식
 *                                if(조건)
 *                                {
 *                                     조건 true 일 때 수행문장
 *                                     }
 *                                else
 *                                {
 *                                        조건 false 일 때 
 *                                        }
 *                  3) 다중 조건문
 *                     => 메뉴 
 *                     => 조건 중에 맞는 문장 한개만 수행
 *                     => 처음 => 순차적으로 조건을 검색
 *                     => 형식)
 *                         if(조건문)
 *                         {
 *                              true시 수행 - 종료
 *                         }
 *                         else if(조건문)
 *                         {
 *                             true시 수행 - 종료
 *                         }     
 *                         else if(조건문)
 *                         {
 *                             true시 수행 - 종료
 *                         }           
 *                         else if(조건문)
 *                         {
 *                             true시 수행 - 종료
 *                         }           
 *                         else
 *                         {
 *                            해당 조건이 없는 경우에 수행 => 생략이 가능
 *                            }
 *               = 선택문 : 값을 1개만 찾는 방법
 *                         = 네트워크 통신 (내부 프로토콜) => 숫자
 *                           => WEB도 네트워크 통신 => 파일명을 이용
 *                           => 게임에서 키값
 *                           => 가독성이 좋다
 *                           => 값이 많은 경우에는 소스량이 길어진다
 *                           => 범위 : 다중 조건 / 값이 몇개 있는 경우 선택 조건
 *                        형식)
 *                          switch()
 *                          {
 *                              case "1" -> 처리문장
 *                              case "2" -> 처리문장
 *                              case "3" -> 처리문장
 *                              ..
 *                              default -> 처리문장
 *                          }
 *                                             
 *                     = 반복문
 *                       for   반복 횟수 지정
 *                             => 화면 UI / 페이지 나누기 / 배열 / 컬렉션
 *                                                     -----------
 *                                                     | 고정 | 가변 |
 *                                                     데이터 여러개를 모아서 관리
 *                       while  반복 횟수가 없는 경우
 *                             => 백엔드 / 데이터베이스 연동 / 게임
 *                       do while : 1번 이상 반드시 반복
 *                     = 반복 제어문 : 반복 중단 / 반복을 건너뛴다
 *   3. 데이터를 묶어서 사용
 *     
 *     배열     클래스
 *     | 같은데이터형
 *                 | 다른 데이터형
  *  4. 관련된 명령문을 묶어서 사용 : 재사용 -> 메소드
  *  5. 유지보수를 쉽게 할 수 있게 만든다 
  *   => 객체 지향 프로그램 => 조립
  *  6. 설계 => UML => 인터페이스 / 추상클래스
  *  7. 비정상 종료 없는 프로그램 : 예외처리
  *  8. 자바에서 지원하는 라이브러리 
  *    open 라이브러리 : mvnrepository.com
  *  9. 다른 컴퓨터 연결 
  *     네트워크 / 쓰레드
  *     => 데이터베이스
  *  10. 새로 등장하는 과정 : 람다식     
  *  
  *  1) for : 반복문
  *       형식)
  *          for(초기값;조건문;증가식)
  *              ----       ---- 몇번 수행
  *              어디서부터
  *            {
  *               반복 문장
  *            }
  *            
  *           순서)             | false면 종료 true면 문장 수행
  *                       1    2   <=4|
  *                 for(초기값;조건문;증가식)
  *                 {
  *                    반복문장 3
  *                 }
  *                 
  *                 
  *             1-2-3-4
  *               2-3-4
  *               2-3-4
  *               ---> 2번에서 false면 종료
  *               
  *               
  *               for(int i=1;i=3;i++)
  *               {
  *                    Sysout(i)
  *               }
  *                 i=1 i=<3 : true => 1 => i++
  *                  i=2 i=<3 : true => 2 => i++
  *                   i=3 i=<3 : true => 3 => i++
  *                    i=4 i=<3 : false => 종료
 */    

// A~Z출력
public class 반복문_1 {
   public static void main(String[] args) {
	for(char c='A';c<='Z';c++)
	{
		System.out.println(c);
	} // c 변수는 자동으로 소멸
	System.out.println("\n==소문자==");
	for(char b='a';b<='z';b++)
	{
		System.out.println(b);
	}  
	  System.out.println("\n===대문자 역으로===");
	  for(char c='Z';c>='A';c--)
		{
			System.out.println(c);
		}
	  System.out.println("\n==소문자==");
		for(char b='z';b>='a';b--)
		{
			System.out.println(b);
		}  
		
      for(int a=1;a<=10;a+=2)
      {
    	  System.out.println(a);
      }
      
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
}







