/*/
 *  제어문
 *   => 프로그램 실행중에 흐름변경 (내용)
 *     => 조건에 따라서 실행 변경 (조건, 선택문)
 *                            if, switch
 *     => 같은 일을 반복 (반복문)
 *                     for / while / do while
 *     => 반복 중단 / 제외 (반복제어문)
 *                       break / continue
 *   ------------------   
 *      1. 조건문 = 판단 => 조건에 따라서 실행할 결정
 *       if / if else / if else if                 
 *   ---------------------------
 *     2. 값에 따라 선택 => 메뉴, 네트워크 서버, 게임  
 *        switch
 *   ------------------  
 *   3. 반복문 => 목록 / 게시판 목록 
 *     for : 반복 횟수가 지정
 *     while : 반복 횟수를 알 수 없다
 *     ------------------------- 선조건 검사
 *     do ~while : 반드시 한번 이상 수행 => 후조건 검사
 *   ------------------  
 *   4. 반복 제어문 => 종료 / 건너 뛴다
 *       break / continue 
 *   --------------
 *   
 *   주의점
 *    1) ;의 위치
 *      if (조건) 
 *       실행문장1;
 *       실행문장2; ==> if 소속 x
 *       
 *       if(조건) 
 *       { 
 *           실행문장1;
 *           실행문장2;
 *           }
 *           
 *    => 가장 많이 사용되는 연산자
 *         => 비교 연산자 / 논리 연산자 / 부정 연산자 => 조건\
 *         
 *         if 조건이 true 일때 false 면 x
 *         => 오류처리
 */
public class 제어문_요약 {

}
